Repository: mozilla-l10n/mt-training-data
Catalog: hno/hno_pontoon.tmx
Source language: en_us
Languages: hno

source: Ruuli
hno: رولی

source: s
hno: چھوڑو

source: S
hno: چھوڑو

source: Sabah Bisaya
hno: صباح بسایا

source: Sabah Malay
hno: سباہ مالے

source: Sa'ban
hno: سابان

source: Sakha
hno: ساکھا

source: Sakizaya
hno: ساکیزایا

source: Santali (Ol Chiki)
hno: سنتالی(اول چِکی)

source: Saraiki
hno: سرائیکی

source: Sardinian
hno: ساردینی

source: Save
hno: محفوظ

source: Saved
hno: محفوظ ہویا

source: Scots
hno: سکوٹس

source: Scripted Speech
hno: لکھی دی گل/تقریر

source: Search
hno: ڈھونڈو

source: Seediq
hno: سیڈیق

source: See how your progress compares to other contributors all over the world.
hno: اپنڑی پیش رفت دا پوری دنیا دے کنٹریبیوٹرز نال موازنہ کرو۔

source: See Less
hno: گھٹ دکھو

source: See More
hno: ہور دکھو

source: Select a Language...
hno: چنڑو اک زبان

source: Select an option
hno: ہک آپشن چُنڑو

source: Select a variant (optional)
hno: ہک لہجہ چنڑو (اختیاری)

source: Selected
hno: چُنڑے دے

source: Select File
hno: فائل دا انتخاب کرو

source: Select File to Upload
hno: اپلوڈ کرنا واسطے فائل دا انتخاب کرو

source: Select the desired language dataset and choose the version you wish to download.
hno: مطلوبہ زبان دا ڈیٹا سیٹ چنڑو ہور انتخاب کرو جڑا ورژن تسیں ڈاؤن لوڈ کرنا چہندے ہو۔

source: Select up to three domains (optional)
hno: ِترے تک ڈومیناں دا انتخاب کرو (اختیارہے)

source: Select your age
hno: اپنڑی عمر چنڑو

source: Select your sex or gender
hno: اپنڑی جنس یا صنف چُنڑو

source: Self Citation
hno: اپنڑا حوالہ

source: Send a link to my email
hno: مڑی ای میل تے ہک لنک بھیجو

source: Send sign up link
hno: سائن اپ دا لنک بھیجو

source: Sentence
hno: جملہ

source: Sentence Collection
hno: جملیاں دا مجموعہ

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
hno: <sentenceCollectorFragment>جملے جمع کرنے تے ہور دکھو</sentenceCollectorFragment>۔

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
hno: <sentenceCollectorVideo>Sentence collector کو استعمال کرنا واسطے اسدی گائیڈ دکھو</sentenceCollectorVideo>۔

source: Sentence Domain
hno: جملے دی ڈومین

source: Sentences
hno: جملے

source: Sentences are collected for people to read aloud.
hno: جملے جمع کیتے جلدے ہن تاکہ لوگ اوچی آواز بچ پڑہن۔

source: Sentences are vetted through a community-moderation process, however this process is not perfect. If you see or hear a sentence that offends or upsets you - for example because it violates our <participationGuidelines>community participation guidelines</participationGuidelines> - please do use the flag button in the UI. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment>.
hno: جُملیاں دی پڑتال کمیونٹی-موڈریشن دے ذریعے کِیتی جلدی ہِے، لیکن اے عمل بھی مکمل نیں ہے۔ اگر تُسیں ہک جملہ دِیخدے یا سنڑدے ہو جِڑا تساں کوبیزار یا پریشان کردا ہِے - مثال دے طور تے کِیّاں کہ اے اسدی<participationGuidelines>کمیونٹی دے شامل ہونڑا بارے ہدایتاں</participationGuidelines> دی خلاف ورزی کردا ہِے- مہربانی نال UI بچ جھنڈے آلے بٹنڑا کو استعمال کرو۔ تُسیں <emailFragment>commonvoice@mozilla.com</emailFragment> اُتا بھی اساں نال رابطہ کر ہکدے ہو۔

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
hno: اتھا عطیہ کیتے دے جملے عوامی دستیابcc-0لائسنس ڈیٹا سیٹ بچ شامل ہو جلسن۔

source: Sentences must be reviewed and accepted by two people to be included in Common Voice. You create guidelines for your language <languageGuidelinesLink>here</languageGuidelinesLink>. Sentences must be in the <licenseLink>public domain</licenseLink> and shorter than 15 words. You can ask the owner of a text to make it <waiverLink>CC0 using our waiver process</waiverLink>, and send to us on commonvoice@mozilla.com
hno: کامن وائس بچ شامل کرنا واسطے جملیاں دا دو لوگاں دا جائزہ گنّنا ہور قبول کرنا چاہیدا ہے۔ تسیں <languageGuidelinesLink>اِتھا</languageGuidelinesLink>اپنڑی زبان واسطے ہدایت نامہ بڑیندے ہو۔ جملے <licenseLink>عوامی ڈومین</licenseLink> تے 15الفاظ تو چھوٹے ہونڑے جاہیدے ہن۔ تسیں لکھائی دے مالک کو <waiverLink> CC0واسطے اسدا چھوٹ دا عمل استعمال کردیاں ہویاں چھوٹ واسطے آکھ سکدے ہو، ہور اساں کو commonvoice@mozilla.com تے بھیچ سکدے ہو۔

source: { $sentences } sentences reviewed. Thank you!
hno: جملیاں دا جائزہ ہو گیا۔ شکریہ!

source: Sentence text
hno: جملے دی عبارت

source: Sentence Variant
hno: جملے دا لہجہ

source: Separate sentences into one line by pressing “Enter” or “Return” once
hno: “داخل کرو” یا “واپس کرو” دبا کے جملیاں کو ہک لائن بچ علیحدہ کرو

source: Serbian
hno: سربی

source: Seri
hno: سیری

source: Serian Bidayuh
hno: سرین بدایو

source: Service and Retail
hno: خدمت تے پرچون

source: Set a goal
hno: ہک ہدف طے کرو

source: Set my visibility
hno: مڑی مرئیت مقرر کرو

source: Setswana
hno: ستوانا

source: Settings
hno: ترتیباں

source: Sex
hno: جنس

source: Sex or Gender
hno: جنس یا صنف

source: SHA256 Checksum Copied!
hno: SHA256 چیکسم کاپی کر چُھڑیا

source: Shan
hno: شان

source: Share Common Voice
hno: Common Voice شیئر کرو

source: Share my goal
hno: مڑا ہدف شیئر کرو

source: Share your clip
hno: آپنٹرے کلپ شیئر کرو

source: Share your { $count } Clip Daily Goal for { $type }
hno: { $type } واسطے روز دا مقصد آپنڑا { $count } کلپ شیئر کرو

source: Share your { $count } Clip Weekly Goal for { $type }
hno: { $type } واسطے ہفتے دا مقصد آپنڑا { $count } کلپ شیئر کرو

source: Share your event
hno: آپنڑا پروگرام/واقعہ شیئر کرو

source: Shilha
hno: شلہا

source: Shina
hno: شینا

source: Shortcuts
hno: شارٹ کٹ

source: [Should be ‘dinosaurs’]
hno: [ 'ڈایناسور' ہونڑا چاہیدا ہے]

source: [Should be “We are”]
hno: [ہونڑا چائی دا“اسیں ہاں”]

source: Show me sentences and clips from all variants within my language
hno: مڑی زبان بچ ساریاں لہجیاں دے جملے تے کلپ مکو دسو۔

source: Show my ranking
hno: مڑی رینکنگ دسو

source: Sicilian
hno: سسلین

source: Sign up
hno: سائن اپ کرو

source: Sign up for an account
hno: اکاؤنٹ واسطے سائن اپ کرو

source: Sign up for Common Voice newsletters, goal reminders and progress updates
hno: کامن وائس نیوزلیڑز، مقصد دی یاد دہانیاں تے پیش رفت اپڈیٹاں واسطے سائن اپ کرو

source: sign up for email updates
hno: ای میل اپڈیٹاں آستے سائن اپ کرو

source: Sign up for { $lang } updates:
hno: { $lang }اپڈیٹاں آستے سائن اپ کرو:

source: Sindhi
hno: سندھی

source: Single
hno: کلا

source: Single sentence submission
hno: کلّھا جملہ جمع کرنا

source: Single ZIP file containing
hno: کلہی زپ فائل تے مشتمل

source: Sinhala
hno: سنہالی

source: Siswati
hno: سسواتی

source: Size
hno: سائز

source: Skip
hno: چھوڑو

source: Skipped
hno: چھوڑ دِتا

source: Skip Submission Feedback
hno: سبمشن فیڈبیک چھوڑو

source: Slovak
hno: سلواک

source: Slovenian
hno: سلو وینی

source: Small batch
hno: نکی کھیپ

source: Small batch sentence submission
hno: نکی کھیپ جملیاں دی جمع کرنا

source: Small businesses, including tech and AI start ups
hno: ٹیکنالوجی تے اے آئی سٹارٹ اپ سمیت نِکے کاروبار

source: [Sneeze] The giant dinosaurs of the [cough] Triassic.
hno: [چھینک]ٹریاسک دے [کھانسی] دیوہیکل ڈایناسور۔

source: Social media
hno: سوشل میڈیا

source: Solicit personally identifying information (like names or financial information)
hno: ذاتی شناخنتی معلومات منگنڑا (جیّاں ناں ہور روپیاں بارے معلومات)

source: Somali
hno: صومالی

source: Some languages have enormous variation in grammar, vocabulary and pronunciation. For this reason, we are <ctaLink>introducing ‘Variants’</ctaLink> in 2022. This gives communities a way to distinguish their languages within the larger dataset.
hno: کوئیاں زباناں بچ گرامر، الفاظ ہور تلفظ بچ زیادہ فرق ہوندا ہے۔ اسی وجہ تو اساں 2022 اِس بچ </ctaLink> ’متغیرات‘ <ctaLink> متعارف کرا رہ ہاں۔ اہ کمیونٹیز کو اپنڑیاں زباناں کو ہک بڑے ڈیٹا سیٹ بچو علحدہ کرنا دا ہک طریقہ دیندا ہے۔

source: Someone asks for a language to be added.
hno: ہک آدمی زبان درج کرنے دا اکھدا اے۔

source: Something went wrong while fetching audio for transcriptions. Please try again later.
hno: آڈیو ٹرانسکرپشن آسطے آنڑدیاں کجھ غلط ہو گیا۔ بعد بچ دبّارہ کوشش کریو، مہربانی۔

source: Something went wrong while fetching prompts. Please try again later.
hno: پُرومٹس آنڑدیاں کجھ غلطی ہو گئی۔ بعد بچ دبّارہ کوشش کرو، مہربانی۔

source: Something went wrong while fetching transcriptions. Please try again later.
hno: ٹرانسکرپشن آنڑدیاں کجھ غلطی ہو گئی۔ بعد بچ دبّارہ کوشش کرو، مہربانی۔

source: Something went wrong with reCAPTCHA. Please try again.
hno: reCAPTCHA نال کجھ خرابی ہو گئی۔ دوبارا کوشش کرو، مہربانی۔

source: Some variants and dialects within a language or language family are very different from each other. If you’re having trouble engaging around a particular variant, you can change your preferences here.
hno: زبان یا زبان دے خاندان بچ کجھ لہجے تے بولیاں ہک دوسرے کولو مُچ مختلف ہوندے ہن۔ اگر تساں کو کسی خاص لہجے دے اردگرد مشغول ہونڑا بچ مشکل آ ری اے تے تسیں اِتھا آپنڑیاں ترجیحاں بدلا سکدے او۔

source: Soninke
hno: سوننکی

source: Sorbian, Lower
hno: ترلے سربیئن

source: Sorbian, Upper
hno: اُتلے سربیئن

source: Sorry, Common Voice is running slowly. Thanks for your interest.
hno: معذرت خواہ ہاں، کامن وائس آستہ چل رہیا ہے۔ تُسدی دلچسپی دا شکریہ

source: Sorry, something went wrong
hno: معذرت، کوئی مسئلہ ہو گیا آسا

source: Source: { $sentenceSource }
hno: ذریعہ: { $sentenceSource }

source: Southern Kurdish
hno: جنوبی کُردش

source: Southern Pastaza Quechua
hno: جنوبی پاستازا کیوچوا

source: Southern Sotho
hno: جنوبی سوٹھو

source: Southwestern Tlaxiaco Mixtec
hno: ساوتھ ویسٹرن لاسیاکو مکسٹیک

source: Spanish
hno: سپینی

source: Speak
hno: بولو

source: Speakable
hno: بولنا دے قابل

source: Speakers
hno: بولنا آلے

source: Speaking
hno: بولنڑاں

source: Speaking and Listening
hno: بولنڑاں ہور سنڑناں

source: Speak in your normal voice! The way you speak is welcome here - we want your accent as it is, and we want your usual volume, style and intonation.
hno: اپنڑی معمول دی آواز بچ بولو! جڑے طریقے تسیں بولدے ہو اُس کو اِتھا خوش آمدید آکھساں-جسطرح دا تسدا لہجہ ہے اسیں او چہندے ہاں، ہور اسیں تسدی عام آواز، طریقہ ہور آواز دا اتار چڑھاؤ چہندے ہاں۔

source: Speak now
hno: ہونڑ بولو

source: Speak options menu
hno: اختیارات آلے مینو کو بولو

source: Speak up, contribute here!
hno: بولو، اِتھا حصہ بھاؤ!

source: Special Characters and Foreign Letters
hno: حاص حروف تے غیرملکی حروف

source: Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
hno: خصوصی علامتاں تے رموز صرف اسی صورت شامل کرنے چاہیدے ہن جدوں بالکل ضروری ہوون۔ مثال دے طور تے، انگریزی الفاظ جِیاں "don’t" تے "we're" بچ ہک apostrophe شامل ہے کو سورس ٹیکسٹ بچ شامل کرنا چاہیدا ہے، لیکن اے گل نیں ہو ہکدی کہ تساں کو کدے بھی "@" یا "# ”جئی خصوصی علامت دی ضرورت پئے۔

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
hno: <speechBlogLink>سپیچ ریکگنیشن نال شروع کرو</speechBlogLink>

source: Spelling and Punctuation
hno: ہجے تے علامتاں

source: Split into { $archiveCount } ZIP files containing
hno: { $archiveCount }زپ فائلاں بچ تروڑو جنہاں بچ شامل ہن

source: Splits
hno: ٹکڑے

source: Splits (Age and Sex)
hno: تقسیم (عمر تے جنس)

source: Spontaneous Speech
hno: خود بخود گل/تقریر

source: Start recording
hno: ریکارڈنگ شروع کرو

source: Start typing to describe your accent
hno: آپنڑا لہجہ بیان کرنا آستے ٹائپ کرنا شروع کرو

source: Stats
hno: شماریات

source: Status Page
hno: سٹیٹس آلہ صفحہ

source: Still have questions?
hno: حالاں بھی سوال ہن؟

source: Streaks
hno: سٹریک

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
hno: <strong>[کریکل]<strong/>دیوہیکل ڈایناسار <strong>[کریکل]</strong>-ریاسک دے۔

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
hno: <strong>ایجھے کلپس کو رد نہ کریو جتھے بولنے والے دا ‘ہک لہجہ ہے’ جِڑھا تسدے تو مختلف ہے</strong>-ایہ وائس ریگنیشن واسطے ضروری ہے کہ ہر ہک واسطے بہتر کم کرا۔

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
hno: <strong>تخلیقی بنڑو!</strong> تسدی زبان برادری منفرد ہوسی، تے ایہ شروع کرنا دے چند ہک طریقے ہن۔

source: <strong>Scripted Speech</strong> (traditionally what you know as Common Voice) is where you can read sentences aloud in your language.
hno: <strong>لکھی دی تقریر/گل</strong>(جِڑّا روایتی طور تسیں جانڑدے او جِیّاں کامن وائس) او اے، جِتھّا تسیں اپنڑی زبان اچ اُچِّی آواز نال جملے پڑھ ہکدے او۔

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
hno: <strong>[سنیز]<strong/> دیوہیکل ڈایناسار <strong>[کف]</strong>۔ٹریاسک دے۔

source: <strong>Spontaneous Speech</strong> is a new part of Common Voice where you can respond to questions in a more organic, colloquial way.
hno: <strong>بے ساختہ تقریر/گل</strong>ہک کامن وائس دا نوّاں حصہ اے جِتھّاں تسیں زیادہ اصلی تے عام طریقے نال سوالاں دے جواب دے ہکدے او۔

source: Submit
hno: جمع کرالو

source: Submit All
hno: سارا جمع کرالو

source: Submit a new question for the community to read and respond to
hno: کمیونٹی واسطے ہک نیا سوال پڑھنا تے جواب دینڑا آستے جمع کرالو

source: Submit a report
hno: رپورٹ جمع کرالو

source: Submit clips
hno: کلپ جمع کرالو

source: Submit new questions for the community to read and respond to
hno: کمیونٹی واسطے نیا سوال پڑھنا تے جواب دینڑا آستے جمع کرالو

source: Submitted
hno: جمع ہویا

source: Subscribe
hno: سبسکرائب

source: Success
hno: کامیابی

source: success checkmark
hno: کامیابی دا نشانڑ

source: Success, profile created!
hno: کامیابی، پروفائل بنڑ گئی!

source: Support open, community-led datasets
hno: عام طور تے دستیاب، کمیونٹی آلے ڈیٹس سیٹ دا ساتھ دیو

source: Svan
hno: سوان

source: Swahili
hno: سواحلی

source: Swedish
hno: سویڈش

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
hno: جملے منظور کرݨ کیتے سڄے ہاسے انگل مارو۔ مسترد کرݨ کیتے کھٻے پاسے انگل نال پونجھو۔ ایں کوں چھوڑݨ کیتے اتلے پاسے پونجھو۔ <strong>آپݨاں ریوو جمع کرواوݨ نہ بھُلو!</strong>

source: Syriac
hno: شامی

source: Tagalog
hno: ٹیگا لاگ

source: Tahitian
hno: تہیتی

source: Taiwanese (Minnan)
hno: تایوانی (منان)

source: Tajik
hno: تاجک

source: Taking several attempts to read a word.
hno: ہک لفظ کو پڑھنا واسطے کئ کوششاں کرنا

source: Tamazight
hno: تمازائٹ

source: Tamil
hno: تامل

source: Tap
hno: انگلی لاؤ

source: Tarifit
hno: تریفیت

source: Tatar
hno: تاتار

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
hno: Tatoeba جملیاں، ترجمے ہور سپکوکن آڈیو کو زبان سیکھنڑا بچ استعمال کرنے دا ہک بڑا ڈیٹا بیس ہے۔

source: Technology and Robotics
hno: ٹیکنالوجی اتے روبوٹکس

source: Technology that speaks your language
hno: ٹیکنالوجی جڑّی تسدی زبان بولا

source: TED-LIUM Corpus
hno: TED-LIUM کارپس

source: Teke
hno: ٹیکی

source: Tell us what you'd like to download:
hno: اساں کو دسو تسیں کے ڈاؤنلوڈ کرنا چہندے ہو:

source: Telugu
hno: تیلگو

source: Tepeuxila Cuicatec
hno: تیپیوکسیلا کیوکیٹک

source: Terms
hno: شرطاں

source: <termsLink>Terms</termsLink>
hno: <termsLink>شرطاں</termsLink>

source: Teutila Cuicatec
hno: ٹیوٹیلا کیوکیٹک

source: Thai
hno: تھائی

source: Thanks for confirming your account, now let's build your profile.
hno: آپنڑے اکاؤنٹ دی تصدیق کرنے آستے شکریہ۔ ہونڑ آپنڑی پروفائل بنڑاؤ۔

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
hno: 50 کولو زائد زباناں بچ 259k تو زیادہ لوگاں دے تعاون دا شکریہ، اے ڈیٹا انسانی آواز کو بہتر طریقے نال جواب دینڑے واسطے تقریر دے قابل ایپلی کیشنز دی تربیت کیتے استعمال ہو رہیا ہے۔

source: Thank you for contributing to Spontaneous Speech!
hno: بے ساختہ تقریر تعاون کرنا دا شکریہ!

source: Thank you for contributing your bulk submission!
hno: آپنڑی بڑی تعداد جمع کیتے جملیاں دینڑا واسطے شکریہ!

source: Thank you for contributing your voice!
hno: آپنڑی آواز دینڑا واسطے شکریہ!

source: Thank you for donating your voice clips!
hno: آپنڑی وائس کلپس دینڑے واسطے شکریہ!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
hno: ریکاڈنگ واسطے شکریہ!<lineBreak></lineBreak>ہونڑ جائز گھنو ہور تلہ آپنڑے کلپ جمع کرالو۔

source: Thank you for your information
hno: تُسدی معلومات آسطے شکریہ

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
hno: { $lang }بچ حصہ بینڑا دی تُسدی دلچسبی دا شکریہ۔ اساں ہر زبان کو لانچ واسطے تیار کرنا کیتے سخت محنت کیتی ہور ٹیماں کو ای میل دے ذریعے اپڈیٹ رکھیا۔ اگر تُسیں حصہ بینڑا چہندے ہو، تے مہربانی نال تلے اپنڑی ای میل دیو۔

source: Thank you for your voice information
hno: تسدی آواز دی معلومات واسطے شکریہ

source: Thank you! You’ve sent a new language enquiry
hno: تسدا شکریہ! تُساں ہک نئی زبان بارے تحقیق جولی اے

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
hno: بہترین جملے فطری تے گل بات آلے ہون٘دے ہن — اے کسی واسطے بھی پڑھنے بچ آسان ہونڑے چاہِیدے ہن۔ جبکہ آواز دا تنوع تے جملیاں بچ مختلف لفظ اہم ہن، اسیں اے کوشش کر رے ہاں کہ ریکارڈنگ جملیاں کو آپنڑی رضاکار برادری آستے ہر ممکن حد تک دِلچسپ تے تفریحی بنڑاواں۔

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
hno: ہک کارآمد سپیچ ریکگنیشن انجن بنڑینڑاں واسطے بہترین جملے روز مرہ دے ہن، جدید بول چال۔ جملے بنڑانڑ بچ تسدی مدد کرنا آستے کوئی خیالات ہن؛

source: The bumblebee sped by.
hno: شہد دی بڑی مکھی تیزی نال اگھا گئی۔

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
hno: کلپ قبرستان بچ اُو آواز دے کلپس ہن جڑے کامن وائس ڈیٹا سیٹ بچ شامل نہیں ہو سکے۔ ڈیٹا سیٹ دی طرح، کلپ قبرستان بھی ڈاؤن لوڈ واسطے میسر ہے۔ اسیں اِناں لوگاں ہور اداریاں دا شکریہ ادا کرنا چہندے ہاں، اُس مدد دا جڑی اُناں پروگرام نال کیتی:

source: The clip has disrespectful or offensive language.
hno: اس کلپ بچ بےعزتی والی ہو غیر مہذب زبان ہے۔

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
hno: کامن وائس ڈیٹا سیٹ بچ سیکڑے ہزاراں آواز دے نمونے موجود ہن جڑے ڈویلپرز کو آواز دی شناخت دے اوزار بڑانڑ بچ مدد کردے ہن۔

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
hno: کمیونٹی کامن وائس دا دھڑکدا دل ہے - زبان دے کارکن، سائنسدان تے فنکار ہن تے او پوری دنیا تو آندے ہن۔ تساں اسدے <about>About</about> صفحے تے ہور اسدی <community>کمیونٹی پلے بک</community> بچ شامل ہونڑا دے بارے مزید جانڑ سکدے او۔ اگر تسیں گہری تنظیمی حصہ داری بچ دلچسپی رکھدے ہو، تے <emailFragment>رابطہ کرو۔</emailFragment>

source: The content contains a language different than I was expecting.
hno: متن بچ جڑّی میں چہنداں آساں اس کولو مختلف زبان اے۔

source: The content has disrespectful or offensive language.
hno: متن بچ بےعزتی والی یا ناشائستہ زبان ہے۔

source: The giant dino [cough] the Triassic.
hno: ٹریاسک[کھانسی] دیوہیکل ڈایناسور۔

source: The giant dinosaur of the Triassic.
hno: ٹریاسک دا دیوہیکل ڈایناسور۔

source: The giant dinosaurs of the Triassi-.
hno: ٹریاسک دے دیوہیکل ڈایناسور۔،

source: The giant dinosaurs of the Triassic.
hno: ٹریاسک دے دیوہیکل ڈایناسور۔

source: The giant dinosaurs of the Triassic. [read by one voice]
hno: ٹریاسک دے دیوہیکل ڈایناسور۔ [ہک آواز بچ پڑھیا دا]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
hno: ٹریاسک دے دیوہیکل ڈایناسور۔ <strong>[ہک آواز بچ پڑھیا دا]</strong>

source: The giant dinosaurs of the Triassic. Yes.
hno: ٹریاسک دے دیوہیکل ڈایناسور، ہاں،

source: The giant dino <strong>[cough]</strong> the Triassic.
hno: دیوہیکل ڈاینا <strong>[کف]</strong>ٹریاسک دے۔

source: The MediaRecorder API is not supported in your browser.
hno: تسدا براؤزر API میڈیا ریکاڈر کو سپورٹ نیں کردا۔

source: The number of recordings and which languages you contribute to will be public.
hno: ریکاڈنگ دی تعداد ہور جنہاں زباناں بچ تُساں حصہ بائے دا ہے، عوامی ہوسن۔

source: The page you are looking for could not be found
hno: تُسیں جڑا صفحہ ڈھونڈے او اُو نیں مل ہکیا

source: There are currently no prompts for this language. Please refresh the page or try again later.
hno: وقتی طور تے اس زبان بچ کوئی پرومٹس نیں۔ مہربانی نال صفحے تازہ کرو یا فِر بعد بچ کوشش کریو۔

source: There are currently no sentences to review in this language.
hno: اس وقت اس زبان بچ نظرثانی واسطے کوئی جملے نیں۔

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
hno: اس زبان دیاں ہور کوئی ٹرانسکرپشناں جائزہ گِھنّا آسطے نیں۔ مہربانی نال صفحے کو تازہ کرو یا فِر بعد بچ کوشش کریو۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
hno: زبان دے بارے سوچنڑاں دے مچ سارے طریقے ہن۔ سپیچ ریکگنیشن ماڈلز دے مقصد واسطے، کامن وائس ’باہمی سمج‘ تے توجہ دینڑا دا مشورہ دیندا ہے، یا ’اِس زبان دے بولنا والے ہک دوسرے کو زیادہ تر سمجھ سکدے ہن اگر او کوشش کرن تے؟‘

source: The recording was too long.
hno: ریکاڈنگ مچ لَمّی آسی۔

source: The recording was too quiet.
hno: ریکاڈنگ خاصی خموش جی آسی۔

source: The recording was too short.
hno: ریکاڈنگ مچ تھوڑی آسی۔

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
hno: وقتی طور تے اس زبان بچ ٹرانسکرائب کرنا آسطے کوئی آڈیو نیں۔ مہربانی نال صفحے تازہ کرو یا فِر بعد بچ کوشش کریو۔

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
hno: سورس ٹیکسٹ بچ مثالی طور تے کوئی ہندسہ نیں ہوونڑا چاہیدا کیاں کہ جدوں اُچی آواز نال پڑھے تے مسائل پیدا کر سکدے ہن۔ جسطرح ہک نمبر کدرے پڑھیا جلد ہے تے او ڈیٹا سیٹ بچ الجھن پیدا کر ہکدا ہے۔ مثال دے طور تے، نمبر “2409” کو "چووی صفر نوں" تے "دو ہزار چار سو نوں" درڑیاں طرح درست طریقے نال پڑھیا جل ہکدا آسا۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
hno: پڑھنا والیاں دے درمیان والیم بچ قدرتی طور تے تغیرات ہوسن۔ صرف اس صورت بچ رد کرو جدوں والیم اتنا اُچا ہوا کہ ریکاڈنگ ترٹ جلا، یا (عام طور تے) اگر او اتنا گھٹ ہوا کہ تسیں تحریری متن دے حوالے تو بغیر سنڑ نہ سکو کہ کہہ آکھیا دا آسا۔

source: The route was unclear.
hno: رستہ واضح نہ آسا۔
